{
  "backend/main.mo": "Motoko canister storing contact submissions, with methods to submit, query, mark as read, and delete entries.",
  "feature_evidence.json": "Feature evidence report describing a team name correction involving the TeamSection component.",
  "frontend-file-summaries.txt": "Prewritten summaries of all frontend components and config files for reference.",
  "frontend/index.css": "Tailwind CSS base file defining design tokens, light/dark theme variables, and global styles.",
  "frontend/index.html": "HTML entry point mounting the React app and loading main.tsx.",
  "frontend/src/App.tsx": "Composes all site sections with header, footer, and toast notifications into the main app layout.",
  "frontend/src/components/site/ContactForm.tsx": "Validated contact form component that submits data via React Query and displays status feedback.",
  "frontend/src/components/site/sections/AboutSection.tsx": "About section displaying mission, community, and approach value cards.",
  "frontend/src/components/site/sections/ContactSection.tsx": "Section wrapper for the contact form with heading and description.",
  "frontend/src/components/site/sections/HeroSection.tsx": "Hero section with headline, intro text, call-to-action buttons, and a hero image with smooth-scroll behavior.",
  "frontend/src/components/site/sections/ProjectsSection.tsx": "Displays three project cards with icons, descriptions, and tags describing the organization's programs.",
  "frontend/src/components/site/sections/TeamSection.tsx": "Renders a grid of team member cards showing names, roles, initials, and bios.",
  "frontend/src/components/site/sections/WhatWeDoSection.tsx": "Shows three core pillars with images and descriptions explaining the group's focus areas.",
  "frontend/src/components/site/SiteFooter.tsx": "Footer with logo, quick links, social icons, and Caffeine.ai attribution.",
  "frontend/src/components/site/SiteHeader.tsx": "Fixed header with scroll-based styling, navigation links, and mobile menu toggle.",
  "frontend/src/hooks/useActor.ts": "Creates and manages the backend actor based on Internet Identity, refetching queries when identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides context and logic for managing Internet Identity login, stored identities, and auth client initialization.",
  "frontend/src/hooks/useQueries.ts": "Defines queries to fetch all or unread contact submissions using the actor.",
  "frontend/src/hooks/useSubmitContactForm.ts": "Mutation hook to submit contact forms and invalidate submissions queries on success.",
  "frontend/src/index.css": "Tailwind base styles with custom color variables, dark mode values, and utility classes.",
  "frontend/src/main.tsx": "Entry point that initializes React, wraps the app with QueryClientProvider and InternetIdentityProvider.",
  "frontend/tailwind.config.js": "Configures Tailwind CSS with custom colors, fonts, container settings, shadows, and plugin integrations for typography, container queries, and animations.",
  "project_state.json": "Stores the project’s current state, schema version, feature definitions, and requirements for the INNO YOUTH website."
}