{
  "backend/main.mo": "Motoko canister handling contact form submissions with storage, retrieval, marking read, and deletion.",
  "feature_evidence.json": "Feature evidence report linking logo‑replacement feature to affected frontend files and components.",
  "frontend-file-summaries.txt": "Text file listing brief summaries of all major frontend components and configuration files.",
  "frontend/index.css": "Tailwind base and theme variables defining color tokens, dark mode overrides, and global styles.",
  "frontend/index.html": "Basic HTML entry point mounting the React app and loading main.tsx.",
  "frontend/src/App.tsx": "Main React app assembling header, sections, footer, and toaster into a single-page layout.",
  "frontend/src/components/site/ContactForm.tsx": "Validated contact form component with client-side checks and submission via React Query.",
  "frontend/src/components/site/sections/AboutSection.tsx": "About section describing mission, community, and approach using icon‑based value cards.",
  "frontend/src/components/site/sections/ContactSection.tsx": "Contact section wrapper providing heading, description, and the ContactForm component.",
  "frontend/src/components/site/sections/HeroSection.tsx": "Landing hero section with tagline, description, CTA buttons, and a featured image with smooth scroll behavior.",
  "frontend/src/components/site/sections/ProjectsSection.tsx": "Displays three program cards with icons, descriptions, and tags for tech workshops, challenges, and outreach.",
  "frontend/src/components/site/sections/TeamSection.tsx": "Renders a team grid with avatar initials, names, roles, and short bios.",
  "frontend/src/components/site/sections/WhatWeDoSection.tsx": "Shows three core pillars with images, titles, and descriptions using a simple grid layout.",
  "frontend/src/components/site/SiteFooter.tsx": "Footer with updated logo, quick navigation links, social icons, and attribution link.",
  "frontend/src/components/site/SiteHeader.tsx": "Fixed header with updated logo, scroll navigation, and mobile menu handling.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to Internet Identity, refetching dependent queries when identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides React context for Internet Identity authentication, including identity loading, login, and logout handling.",
  "frontend/src/hooks/useQueries.ts": "Defines queries for fetching all or unread contact submissions using the backend actor.",
  "frontend/src/hooks/useSubmitContactForm.ts": "Mutation hook that submits contact form data and invalidates submission-related queries.",
  "frontend/src/index.css": "Tailwind setup defining light and dark mode color variables and base/global styles.",
  "frontend/src/main.tsx": "App entry point mounting React with QueryClientProvider and InternetIdentityProvider.",
  "frontend/tailwind.config.js": "Configures Tailwind with dark mode, extended theme tokens, custom colors, fonts, shadows, and plugins for typography, container queries, and animations.",
  "project_state.json": "Stores project metadata, feature definitions, image requirements, and pending feature requests for the INNO YOUTH website."
}